{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "!": 0,
      "\"": 1,
      "#": 2,
      "$": 3,
      "%": 4,
      "&": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      ":": 25,
      ";": 26,
      "<": 27,
      "=": 28,
      ">": 29,
      "?": 30,
      "@": 31,
      "A": 32,
      "B": 33,
      "C": 34,
      "D": 35,
      "E": 36,
      "F": 37,
      "G": 38,
      "H": 39,
      "I": 40,
      "J": 41,
      "K": 42,
      "L": 43,
      "M": 44,
      "N": 45,
      "O": 46,
      "P": 47,
      "Q": 48,
      "R": 49,
      "S": 50,
      "T": 51,
      "U": 52,
      "V": 53,
      "W": 54,
      "X": 55,
      "Y": 56,
      "Z": 57,
      "[": 58,
      "\\": 59,
      "]": 60,
      "^": 61,
      "_": 62,
      "`": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "|": 91,
      "}": 92,
      "~": 93,
      "¡": 94,
      "¢": 95,
      "£": 96,
      "¤": 97,
      "¥": 98,
      "¦": 99,
      "§": 100,
      "¨": 101,
      "©": 102,
      "ª": 103,
      "«": 104,
      "¬": 105,
      "®": 106,
      "¯": 107,
      "°": 108,
      "±": 109,
      "²": 110,
      "³": 111,
      "´": 112,
      "µ": 113,
      "¶": 114,
      "·": 115,
      "¸": 116,
      "¹": 117,
      "º": 118,
      "»": 119,
      "¼": 120,
      "½": 121,
      "¾": 122,
      "¿": 123,
      "À": 124,
      "Á": 125,
      "Â": 126,
      "Ã": 127,
      "Ä": 128,
      "Å": 129,
      "Æ": 130,
      "Ç": 131,
      "È": 132,
      "É": 133,
      "Ê": 134,
      "Ë": 135,
      "Ì": 136,
      "Í": 137,
      "Î": 138,
      "Ï": 139,
      "Ð": 140,
      "Ñ": 141,
      "Ò": 142,
      "Ó": 143,
      "Ô": 144,
      "Õ": 145,
      "Ö": 146,
      "×": 147,
      "Ø": 148,
      "Ù": 149,
      "Ú": 150,
      "Û": 151,
      "Ü": 152,
      "Ý": 153,
      "Þ": 154,
      "ß": 155,
      "à": 156,
      "á": 157,
      "â": 158,
      "ã": 159,
      "ä": 160,
      "å": 161,
      "æ": 162,
      "ç": 163,
      "è": 164,
      "é": 165,
      "ê": 166,
      "ë": 167,
      "ì": 168,
      "í": 169,
      "î": 170,
      "ï": 171,
      "ð": 172,
      "ñ": 173,
      "ò": 174,
      "ó": 175,
      "ô": 176,
      "õ": 177,
      "ö": 178,
      "÷": 179,
      "ø": 180,
      "ù": 181,
      "ú": 182,
      "û": 183,
      "ü": 184,
      "ý": 185,
      "þ": 186,
      "ÿ": 187,
      "Ā": 188,
      "ā": 189,
      "Ă": 190,
      "ă": 191,
      "Ą": 192,
      "ą": 193,
      "Ć": 194,
      "ć": 195,
      "Ĉ": 196,
      "ĉ": 197,
      "Ċ": 198,
      "ċ": 199,
      "Č": 200,
      "č": 201,
      "Ď": 202,
      "ď": 203,
      "Đ": 204,
      "đ": 205,
      "Ē": 206,
      "ē": 207,
      "Ĕ": 208,
      "ĕ": 209,
      "Ė": 210,
      "ė": 211,
      "Ę": 212,
      "ę": 213,
      "Ě": 214,
      "ě": 215,
      "Ĝ": 216,
      "ĝ": 217,
      "Ğ": 218,
      "ğ": 219,
      "Ġ": 220,
      "ġ": 221,
      "Ģ": 222,
      "ģ": 223,
      "Ĥ": 224,
      "ĥ": 225,
      "Ħ": 226,
      "ħ": 227,
      "Ĩ": 228,
      "ĩ": 229,
      "Ī": 230,
      "ī": 231,
      "Ĭ": 232,
      "ĭ": 233,
      "Į": 234,
      "į": 235,
      "İ": 236,
      "ı": 237,
      "Ĳ": 238,
      "ĳ": 239,
      "Ĵ": 240,
      "ĵ": 241,
      "Ķ": 242,
      "ķ": 243,
      "ĸ": 244,
      "Ĺ": 245,
      "ĺ": 246,
      "Ļ": 247,
      "ļ": 248,
      "Ľ": 249,
      "ľ": 250,
      "Ŀ": 251,
      "ŀ": 252,
      "Ł": 253,
      "ł": 254,
      "Ń": 255,
      "Ġt": 256,
      "he": 257,
      "Ġa": 258,
      "in": 259,
      "Ġthe": 260,
      "er": 261,
      "on": 262,
      "Ġ,": 263,
      "un": 264,
      "re": 265,
      "Ġs": 266,
      "Ġw": 267,
      "Ġo": 268,
      "ed": 269,
      "Ġ.": 270,
      "Ġun": 271,
      "at": 272,
      "nd": 273,
      "Ġunk": 274,
      "or": 275,
      "it": 276,
      "Ġc": 277,
      "Ġf": 278,
      "en": 279,
      "Ġof": 280,
      "is": 281,
      "Ġb": 282,
      "es": 283,
      "Ġin": 284,
      "ar": 285,
      "an": 286,
      "al": 287,
      "Ġand": 288,
      "Ġp": 289,
      "ing": 290,
      "as": 291,
      "Ġto": 292,
      "Ġm": 293,
      "ro": 294,
      "ic": 295,
      "Ġd": 296,
      "Ġh": 297,
      "ĠĊ": 298,
      "ion": 299,
      "le": 300,
      "ĠT": 301,
      "Ġre": 302,
      "Ġ\"": 303,
      "Ġth": 304,
      "ou": 305,
      "ent": 306,
      "ĠA": 307,
      "Ġ1": 308,
      "il": 309,
      "st": 310,
      "ĠS": 311,
      "Ġl": 312,
      "Ġe": 313,
      "om": 314,
      "Ġn": 315,
      "Ġ-": 316,
      "ĠC": 317,
      "am": 318,
      "el": 319,
      "ad": 320,
      "Ġwas": 321,
      "ac": 322,
      "ĠThe": 323,
      "Ġon": 324,
      "Ġbe": 325,
      "ur": 326,
      "ly": 327,
      "Ġ'": 328,
      "ĠM": 329,
      "ĠI": 330,
      "Ġg": 331,
      "Ġfor": 332,
      "iv": 333,
      "ter": 334,
      "id": 335,
      "ol": 336,
      "ĠB": 337,
      "im": 338,
      "ir": 339,
      "ig": 340,
      "Ġas": 341,
      "ct": 342,
      "th": 343,
      "ow": 344,
      "ith": 345,
      "Ġ2": 346,
      "Ġst": 347,
      "ĠH": 348,
      "us": 349,
      "ay": 350,
      "Ġwith": 351,
      "Ġthat": 352,
      "ce": 353,
      "ut": 354,
      "Ġhe": 355,
      "ver": 356,
      "ot": 357,
      "ation": 358,
      "et": 359,
      "ĠĊĠĊ": 360,
      "Ġis": 361,
      "Ġby": 362,
      "Ġwh": 363,
      "ĠP": 364,
      "Ġ)": 365,
      "Ġ(": 366,
      "ch": 367,
      "ĠR": 368,
      "Ġal": 369,
      "em": 370,
      "Ġcon": 371,
      "ĠF": 372,
      "Ġat": 373,
      "ĠD": 374,
      "ul": 375,
      "ĠW": 376,
      "Ġ19": 377,
      "Ġit": 378,
      "ain": 379,
      "and": 380,
      "rom": 381,
      "ĠN": 382,
      "Ġan": 383,
      "os": 384,
      "00": 385,
      "her": 386,
      "ers": 387,
      "av": 388,
      "est": 389,
      "Ġse": 390,
      "ĠJ": 391,
      "Ġde": 392,
      "ĠG": 393,
      "ĠL": 394,
      "ag": 395,
      "Ġhis": 396,
      "um": 397,
      "Ġr": 398,
      "Ġfrom": 399,
      "od": 400,
      "Ġcom": 401,
      "ĠO": 402,
      "ri": 403,
      "pe": 404,
      "ĠE": 405,
      "ere": 406,
      "ist": 407,
      "Ġpro": 408,
      "ort": 409,
      "ld": 410,
      "ore": 411,
      "Ġwere": 412,
      "if": 413,
      "Ġv": 414,
      "oun": 415,
      "ies": 416,
      "ill": 417,
      "res": 418,
      "Ġsu": 419,
      "ĠIn": 420,
      "ap": 421,
      "igh": 422,
      "ew": 423,
      "op": 424,
      "ong": 425,
      "ich": 426,
      "ate": 427,
      "all": 428,
      "art": 429,
      "Ġor": 430,
      "ard": 431,
      "ak": 432,
      "ber": 433,
      "gh": 434,
      "ated": 435,
      "ity": 436,
      "Ġch": 437,
      "Ġpl": 438,
      "Ġex": 439,
      "ame": 440,
      "ud": 441,
      "se": 442,
      "ant": 443,
      "ab": 444,
      "Ġare": 445,
      "Ġhad": 446,
      "oc": 447,
      "ive": 448,
      "qu": 449,
      "Ġsh": 450,
      "Ġk": 451,
      "ack": 452,
      "ĠU": 453,
      "ess": 454,
      "Ġwhich": 455,
      "up": 456,
      "ip": 457,
      "red": 458,
      "our": 459,
      "ĠSt": 460,
      "ast": 461,
      "ment": 462,
      "ian": 463,
      "Ġy": 464,
      "Ġnot": 465,
      "Ġle": 466,
      "ge": 467,
      "ov": 468,
      "rit": 469,
      "ĠK": 470,
      "ear": 471,
      "pt": 472,
      "ost": 473,
      "ial": 474,
      "ight": 475,
      "Ġtr": 476,
      "ther": 477,
      "ust": 478,
      "Ġ3": 479,
      "ord": 480,
      "ave": 481,
      "ine": 482,
      "cl": 483,
      "ary": 484,
      "ical": 485,
      "ish": 486,
      "ĠCh": 487,
      "ell": 488,
      "Ġ200": 489,
      "irst": 490,
      "ia": 491,
      "Ġ;": 492,
      "te": 493,
      "ction": 494,
      "pp": 495,
      "fter": 496,
      "Ġbut": 497,
      "Ġtheir": 498,
      "so": 499
    },
    "merges": [
      "Ġ t",
      "h e",
      "Ġ a",
      "i n",
      "Ġt he",
      "e r",
      "o n",
      "Ġ ,",
      "u n",
      "r e",
      "Ġ s",
      "Ġ w",
      "Ġ o",
      "e d",
      "Ġ .",
      "Ġ un",
      "a t",
      "n d",
      "Ġun k",
      "o r",
      "i t",
      "Ġ c",
      "Ġ f",
      "e n",
      "Ġo f",
      "i s",
      "Ġ b",
      "e s",
      "Ġ in",
      "a r",
      "a n",
      "a l",
      "Ġa nd",
      "Ġ p",
      "in g",
      "a s",
      "Ġt o",
      "Ġ m",
      "r o",
      "i c",
      "Ġ d",
      "Ġ h",
      "Ġ Ċ",
      "i on",
      "l e",
      "Ġ T",
      "Ġ re",
      "Ġ \"",
      "Ġt h",
      "o u",
      "en t",
      "Ġ A",
      "Ġ 1",
      "i l",
      "s t",
      "Ġ S",
      "Ġ l",
      "Ġ e",
      "o m",
      "Ġ n",
      "Ġ -",
      "Ġ C",
      "a m",
      "e l",
      "a d",
      "Ġw as",
      "a c",
      "ĠT he",
      "Ġ on",
      "Ġb e",
      "u r",
      "l y",
      "Ġ '",
      "Ġ M",
      "Ġ I",
      "Ġ g",
      "Ġf or",
      "i v",
      "t er",
      "i d",
      "o l",
      "Ġ B",
      "i m",
      "i r",
      "i g",
      "Ġa s",
      "c t",
      "t h",
      "o w",
      "it h",
      "Ġ 2",
      "Ġs t",
      "Ġ H",
      "u s",
      "a y",
      "Ġw ith",
      "Ġth at",
      "c e",
      "u t",
      "Ġ he",
      "v er",
      "o t",
      "at ion",
      "e t",
      "ĠĊ ĠĊ",
      "Ġ is",
      "Ġb y",
      "Ġw h",
      "Ġ P",
      "Ġ )",
      "Ġ (",
      "c h",
      "Ġ R",
      "Ġa l",
      "e m",
      "Ġc on",
      "Ġ F",
      "Ġa t",
      "Ġ D",
      "u l",
      "Ġ W",
      "Ġ1 9",
      "Ġ it",
      "a in",
      "a nd",
      "ro m",
      "Ġ N",
      "Ġa n",
      "o s",
      "0 0",
      "he r",
      "er s",
      "a v",
      "es t",
      "Ġs e",
      "Ġ J",
      "Ġd e",
      "Ġ G",
      "Ġ L",
      "a g",
      "Ġh is",
      "u m",
      "Ġ r",
      "Ġf rom",
      "o d",
      "Ġc om",
      "Ġ O",
      "r i",
      "p e",
      "Ġ E",
      "er e",
      "is t",
      "Ġp ro",
      "or t",
      "l d",
      "o re",
      "Ġw ere",
      "i f",
      "Ġ v",
      "o un",
      "i es",
      "il l",
      "re s",
      "Ġs u",
      "ĠI n",
      "a p",
      "ig h",
      "e w",
      "o p",
      "on g",
      "ic h",
      "at e",
      "al l",
      "ar t",
      "Ġo r",
      "ar d",
      "a k",
      "b er",
      "g h",
      "at ed",
      "it y",
      "Ġc h",
      "Ġp l",
      "Ġe x",
      "am e",
      "u d",
      "s e",
      "an t",
      "a b",
      "Ġa re",
      "Ġh ad",
      "o c",
      "iv e",
      "q u",
      "Ġs h",
      "Ġ k",
      "ac k",
      "Ġ U",
      "es s",
      "Ġwh ich",
      "u p",
      "i p",
      "re d",
      "ou r",
      "ĠS t",
      "as t",
      "m ent",
      "i an",
      "Ġ y",
      "Ġn ot",
      "Ġ le",
      "g e",
      "o v",
      "r it",
      "Ġ K",
      "e ar",
      "p t",
      "o st",
      "i al",
      "igh t",
      "Ġt r",
      "t her",
      "u st",
      "Ġ 3",
      "or d",
      "av e",
      "in e",
      "c l",
      "ar y",
      "ic al",
      "is h",
      "ĠC h",
      "el l",
      "Ġ2 00",
      "ir st",
      "i a",
      "Ġ ;",
      "t e",
      "ct ion",
      "p p",
      "f ter",
      "Ġb ut",
      "Ġthe ir",
      "s o"
    ]
  }
}