{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "!": 0,
      "\"": 1,
      "#": 2,
      "$": 3,
      "%": 4,
      "&": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      ":": 25,
      ";": 26,
      "<": 27,
      "=": 28,
      ">": 29,
      "?": 30,
      "@": 31,
      "A": 32,
      "B": 33,
      "C": 34,
      "D": 35,
      "E": 36,
      "F": 37,
      "G": 38,
      "H": 39,
      "I": 40,
      "J": 41,
      "K": 42,
      "L": 43,
      "M": 44,
      "N": 45,
      "O": 46,
      "P": 47,
      "Q": 48,
      "R": 49,
      "S": 50,
      "T": 51,
      "U": 52,
      "V": 53,
      "W": 54,
      "X": 55,
      "Y": 56,
      "Z": 57,
      "[": 58,
      "\\": 59,
      "]": 60,
      "^": 61,
      "_": 62,
      "`": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "|": 91,
      "}": 92,
      "~": 93,
      "¡": 94,
      "¢": 95,
      "£": 96,
      "¤": 97,
      "¥": 98,
      "¦": 99,
      "§": 100,
      "¨": 101,
      "©": 102,
      "ª": 103,
      "«": 104,
      "¬": 105,
      "®": 106,
      "¯": 107,
      "°": 108,
      "±": 109,
      "²": 110,
      "³": 111,
      "´": 112,
      "µ": 113,
      "¶": 114,
      "·": 115,
      "¸": 116,
      "¹": 117,
      "º": 118,
      "»": 119,
      "¼": 120,
      "½": 121,
      "¾": 122,
      "¿": 123,
      "À": 124,
      "Á": 125,
      "Â": 126,
      "Ã": 127,
      "Ä": 128,
      "Å": 129,
      "Æ": 130,
      "Ç": 131,
      "È": 132,
      "É": 133,
      "Ê": 134,
      "Ë": 135,
      "Ì": 136,
      "Í": 137,
      "Î": 138,
      "Ï": 139,
      "Ð": 140,
      "Ñ": 141,
      "Ò": 142,
      "Ó": 143,
      "Ô": 144,
      "Õ": 145,
      "Ö": 146,
      "×": 147,
      "Ø": 148,
      "Ù": 149,
      "Ú": 150,
      "Û": 151,
      "Ü": 152,
      "Ý": 153,
      "Þ": 154,
      "ß": 155,
      "à": 156,
      "á": 157,
      "â": 158,
      "ã": 159,
      "ä": 160,
      "å": 161,
      "æ": 162,
      "ç": 163,
      "è": 164,
      "é": 165,
      "ê": 166,
      "ë": 167,
      "ì": 168,
      "í": 169,
      "î": 170,
      "ï": 171,
      "ð": 172,
      "ñ": 173,
      "ò": 174,
      "ó": 175,
      "ô": 176,
      "õ": 177,
      "ö": 178,
      "÷": 179,
      "ø": 180,
      "ù": 181,
      "ú": 182,
      "û": 183,
      "ü": 184,
      "ý": 185,
      "þ": 186,
      "ÿ": 187,
      "Ā": 188,
      "ā": 189,
      "Ă": 190,
      "ă": 191,
      "Ą": 192,
      "ą": 193,
      "Ć": 194,
      "ć": 195,
      "Ĉ": 196,
      "ĉ": 197,
      "Ċ": 198,
      "ċ": 199,
      "Č": 200,
      "č": 201,
      "Ď": 202,
      "ď": 203,
      "Đ": 204,
      "đ": 205,
      "Ē": 206,
      "ē": 207,
      "Ĕ": 208,
      "ĕ": 209,
      "Ė": 210,
      "ė": 211,
      "Ę": 212,
      "ę": 213,
      "Ě": 214,
      "ě": 215,
      "Ĝ": 216,
      "ĝ": 217,
      "Ğ": 218,
      "ğ": 219,
      "Ġ": 220,
      "ġ": 221,
      "Ģ": 222,
      "ģ": 223,
      "Ĥ": 224,
      "ĥ": 225,
      "Ħ": 226,
      "ħ": 227,
      "Ĩ": 228,
      "ĩ": 229,
      "Ī": 230,
      "ī": 231,
      "Ĭ": 232,
      "ĭ": 233,
      "Į": 234,
      "į": 235,
      "İ": 236,
      "ı": 237,
      "Ĳ": 238,
      "ĳ": 239,
      "Ĵ": 240,
      "ĵ": 241,
      "Ķ": 242,
      "ķ": 243,
      "ĸ": 244,
      "Ĺ": 245,
      "ĺ": 246,
      "Ļ": 247,
      "ļ": 248,
      "Ľ": 249,
      "ľ": 250,
      "Ŀ": 251,
      "ŀ": 252,
      "Ł": 253,
      "ł": 254,
      "Ń": 255,
      "Ġt": 256,
      "he": 257,
      "Ġa": 258,
      "in": 259,
      "Ġthe": 260,
      "er": 261,
      "on": 262,
      "Ġ,": 263,
      "un": 264,
      "re": 265,
      "Ġs": 266,
      "Ġw": 267,
      "Ġo": 268,
      "ed": 269,
      "Ġ.": 270,
      "Ġun": 271,
      "at": 272,
      "nd": 273,
      "Ġunk": 274,
      "or": 275,
      "it": 276,
      "Ġc": 277,
      "Ġf": 278,
      "en": 279,
      "Ġof": 280,
      "is": 281,
      "Ġb": 282,
      "es": 283,
      "Ġin": 284,
      "ar": 285,
      "an": 286,
      "al": 287,
      "Ġand": 288,
      "Ġp": 289,
      "ing": 290,
      "as": 291,
      "Ġto": 292,
      "Ġm": 293,
      "ro": 294,
      "ic": 295,
      "Ġd": 296,
      "Ġh": 297,
      "ĠĊ": 298,
      "ion": 299
    },
    "merges": [
      "Ġ t",
      "h e",
      "Ġ a",
      "i n",
      "Ġt he",
      "e r",
      "o n",
      "Ġ ,",
      "u n",
      "r e",
      "Ġ s",
      "Ġ w",
      "Ġ o",
      "e d",
      "Ġ .",
      "Ġ un",
      "a t",
      "n d",
      "Ġun k",
      "o r",
      "i t",
      "Ġ c",
      "Ġ f",
      "e n",
      "Ġo f",
      "i s",
      "Ġ b",
      "e s",
      "Ġ in",
      "a r",
      "a n",
      "a l",
      "Ġa nd",
      "Ġ p",
      "in g",
      "a s",
      "Ġt o",
      "Ġ m",
      "r o",
      "i c",
      "Ġ d",
      "Ġ h",
      "Ġ Ċ",
      "i on"
    ]
  }
}